'use strict'; //эта директива обозначает, что пишем
//в стандарте ES6 и некоторые ошибки прошлого работать не будут

//ОПЕРАТОРЫ
let arr = ['plum.png', 'orange.jpg', 'apple.bmp'];

// Если + применить к двум строкам получим строку
// если + применить к числу и строке все равно будет СТРОКА
// ЭТО КОНКАТИНАЦИЯ

console.log("arr" + "-object"); //в консоли будет строка
//и значение из скобок, тип string

console.log(4 + "-object");// //в консоли будет строка
//и значение из скобок, тип string
//не смотря на то, что num+str

//если перед числом представленным
//  в виде string поставить +
// то получится number

let answer = +prompt("Вам есть 18?", "Да");
console.log(typeof(answer)); //получаю ответ
// в виде числа, т.к +prompt  = number

console.log(4 + + "-object"); //получаю ответ
// в виде NaN

//ОПЕРАТОР ИНКРЕМЕНТ И ДЕКРЕМЕНТ
//увеличивают или уменьшают значение на единичку

let incr = 10,
    decr = 10; // переменные можно перечислять через
// запятую, не забывай точку с запятой в конце
incr++;
decr--;

console.log(incr); //получишь 11
console.log(decr); //получишь 9

// Префиксная форма вернет ИЗМЕНЕННОЕ значение
// Постфиксная - СТАРОЕ

// Попробуем ПРЕФИКС
let incr1 = 10,
    decr1 = 10;
console.log(++incr1); //получишь 11
console.log(--decr1); //получишь 9

// Попробуем ПОСТФИКС
let incr2 = 10,
    decr2 = 10;
console.log(incr2++); //получишь 10
console.log(decr2++); //получишь 10

//Опервтор % - возвращает остаток от деления чисел
console.log(5%2);

//Оператор равенства
// Если = присвоил
// Если == проверка на равенство
// Если === строгая проверка по типам данных

console.log("2" == 2); //получаю True
//потому что сравнивет значения

console.log("2" === 2); //получаю False
//потому что сравнения по типам данных

//Логические операторы И и ИЛИ


let isChecked = true,
    isClose = false;

console.log(isChecked && isClose); 
//Оператор И "&&" - умножение логическое

console.log(isChecked || isClose);
//оператор ИЛИ "||" - логическое сложение

//благодаря последним двум можно понять отмечены ли оба чекбокса в форме
//или проверить размер экрана и открыто ли модальное окно

//оператор отрицания "!"
console.log(isChecked && isClose); 
